# -*- coding: utf-8 -*-

import urllib.request
import json
from html.parser import HTMLParser
from 臺灣言語工具.字詞組集句章.解析整理.文章粗胚 import 文章粗胚
from 臺灣言語工具.字詞組集句章.解析整理.拆文分析器 import 拆文分析器

class 教育部外來詞匯入資料庫:
	class 網頁剖析工具(HTMLParser):
		剖析結果 = []
		目前這逝 = []
		目前這格 = ''
		愛記錄 = False
		def 目前剖析結果(self):
			return self.剖析結果
		def handle_starttag(self, tag, attrs):
			if tag == "table" and ('class', 'fuluTab') in attrs:
				self.愛記錄 = True
			if self.愛記錄:
				if tag == "tr":
					self.目前這逝 = []
				elif tag == "td":
					self.目前這格 = ''
		def handle_endtag(self, tag):
			if tag == "table":
				self.愛記錄 = False
			if self.愛記錄:
				if tag == "tr":
					self.剖析結果.append(self.目前這逝)
				elif tag == "td":
					self.目前這逝.append(self.目前這格)
		def handle_data(self, data):
			if self.愛記錄:
				self.目前這格 += data.strip()
	def __init__(self):
		網址 = 'http://twblg.dict.edu.tw/holodict_new/index/fulu_wailaici.jsp'
		資料 = urllib.request.urlopen(網址).read().decode("utf8")
		網頁工具 = self.網頁剖析工具()
		網頁工具.feed(資料)
		結果=網頁工具.剖析結果
		分析器=拆文分析器()
		for 一筆 in 結果[1:]:
			原本假名=一筆[4]
			原本音標=一筆[1]
			標準假名=self.假名配組字式(原本假名)
			標準音標=self.音標處理(原本音標)
# 			print(原本音標,標準音標)
			try:
				詞物件=分析器.產生對齊詞(標準假名, 標準音標)
			except Exception as 問題:
				對照表格式="'{0}':'{0}', #{1}，{2}"
# 				print(對照表格式.format(原本假名,標準音標,一筆[2]))
				print(問題)
	def 音標處理(self, 原本音標):
		粗胚=文章粗胚()
		音=粗胚.數字調英文中央加分字符號(原本音標)
		音 = 音.replace('33', '7')
		音 = 音.replace('55', '1')
		音 = 音.replace('11', '3')
		音 = 音.replace('51', '2')
		音 = 音.replace('35', '5')
		音 = 音.replace('t5', 't8')
		音 = 音.replace('t3', 't4')
		音 = 音.replace('h5', 'h8')
		音 = 音.replace('h3', 'h4')
		音 = '1' + 音.replace('-', '-1')
		return 音
	def 假名配組字式(self, 原本假名):
		if 原本假名 in self.假名對照:
			return self.假名對照[原本假名]
		return 原本假名
	假名對照={
		'アンモニア':'アンモニア', #1a7-1moo1-1ni1-1a2，阿摩尼亞
		'アスピリン':'アスピリン', #1a7-1sir1-1phi1-1lin2，阿斯匹林
		'あいさつ':'あいさつ', #1ai5-1sat8-1tsuh4，問候、打招呼
		'アイスクリ－ム':'アイスクリ－ム', #1ai1-1sirh4-1khu7-1lin2-1mu3，冰淇淋
		'あんない':'あんない', #1an2-1nai7，招待、引導
		'あっさり':'あっさり', #1at4-1sa1-1lih4，乾脆、阿莎力
		'アウト':'アウト', #1au2-1tsuh4，出局
		'バ－ル':'バ－ル', #1ba1-1luh4，拔釘子的器具
		'バタ－':'バタ－', #1ba1-1tah4，奶油
		'バイオリン':'バイオリン', #1bai7-1oo1-1lin2，小提琴
		'ばいきん':'ばいきん', #1bai5-1khin2，黴菌、細菌
		'バック':'バック', #1bak5-1kuh4，倒車
		'バンバ－/バンパ－':'バンバ－/バンパ－', #1ban2-1ba3，保險桿
		'まんが':'まんが', #1bang2-1ga3，卡通、漫畫、動畫片
		'バッテリ－':'バッテリ－', #1bat4-1te1-1lih4，蓄電池
		'バッタ－':'バッタ－', #1bat8-1tah4，球棒
		'ビタミン':'ビタミン', #1bi7-1ta1-1bin2，維他命
		'ビ－ル':'ビ－ル', #1bi2-1lu3，啤酒
		'ベット':'ベット', #1biat8-1tooh4，彈簧床
		'ボクシング':'ボクシング', #1bok3-1sin2-1gu3，拳擊
		'ボ－ル':'ボ－ル', #1boo2-1lu3，壞球
		'ボ－ト':'ボ－ト', #1boo2-1too3，小船
		'ブラジャ－':'ブラジャ－', #1bu7-1la2-1jia3，胸罩
		'エプロン':'エプロン', #1e7-1pu1-1long2，圍裙
		'ガソリン':'ガソリン', #1ga7-1soo1-1lin2，汽油
		'ギタ－':'ギタ－', #1gi2-1ta3，吉他
		'じゃんけん':'じゃんけん', #1giang7，猜拳
		'ごぼう':'ごぼう', #1goo3-1boo7，牛蒡
		'ハ－モニカ':'ハ－モニカ', #1ha7-1moo1-1ni1-1khah4，口琴
		'はいけっかく':'はいけっかく', #1hai5-1khe1-1kha1-1kuh4，肺結核
		'ハイヤ':'ハイヤ', #1hai2-1ia3，高級轎車、包租汽車
		'ハイカラ/ハイ－カラ':'ハイカラ/ハイ－カラ', #1hai1-1kat8-1la2，西裝頭
		'ハンドル':'ハンドル', #1han5-1too1-1luh4，方向盤
		'はんごう':'はんごう', #1hang5-1goo2，飯鍋
		'ホルモン':'ホルモン', #1hoo7-1lu1-1bong2，荷爾蒙
		'エンジン':'エンジン', #1ian5-1jin2，引擎
		'ようかん':'ようかん', #1io5-1kang2，羊羹
		'チャック':'チャック', #1jiak5-1kuh4，拉鍊
		'ジャンパ－':'ジャンパ－', #1jian2-1ba3，夾克
		'じょうとう':'じょうとう', #1jio1-1toh4，高級、上等
		'かばん':'かばん', #1kha7-1bang2，皮包、手提包、文件箱
		'カ－テン':'カ－テン', #1kha7-1tian2，窗簾
		'かあさん':'かあさん', #1kha2-1sang3，母親
		'かあちゃん':'かあちゃん', #1kha2-1tsiang3，母親
		'かんじょう':'かんじょう', #1khan5-1jioo2，結帳、付款、算帳
		'かんばん':'かんばん', #1khang5-1pang2，看板、招牌
		'ケチャップ':'ケチャップ', #1khe7-1tsiap5-1puh4，蕃茄醬
		'きゃはん':'きゃはん', #1khia3-1hang1，綁腿
		'きって':'きって', #1khit8-1teh4，郵票
		'きゅうけい':'きゅうけい', #1khiu5-1khe2，色情幽會、休憩、休息
		'コップ':'コップ', #1khok5-1puh4，杯子
		'コンクリ－ト':'コンクリ－ト', #1khong3-1ku7-1li2，混凝土、控固力
		'こんぶ':'こんぶ', #1khong2-1buh4，昆布、海帶
		'コミッション':'コミッション', #1khoo7-1mi1-1siong2，賄賂、回扣
		'コ－ト':'コ－ト', #1khoo2-1too3，大衣
		'クラッチ':'クラッチ', #1khu7-1la1-1tsih4，變速器、離合器
		'クリ－ム':'クリ－ム', #1khu7-1li2-1mu3，奶油、面霜、克林姆
		'ラケット':'ラケット', #1la7-1kiat8-1tooh4，球拍
		'だいじょうぶ':'だいじょうぶ', #1lai5-1jioo2-1bu3，放心、沒問題、安全
		'ランニング':'ランニング', #1lai5-1lin2-1gu3，無袖背心
		'ライタ－':'ライタ－', #1lai2-1tah4，打火機
		'レモン':'レモン', #1le7-1bong2，檸檬
		'レ－ス':'レ－ス', #1le2-1sir3，蕾絲花邊
		'リヤカ－':'リヤカ－', #1li7-1a1-1khah4，臺車、自行車後面的兩輪拖車、台車
		'れんたん':'れんたん', #1lian5-1tang2，煤球
		'にんじん':'にんじん', #1lin5-1jin2，紅蘿蔔
		'りんご':'りんご', #1lin2-1goo3，蘋果
		'ドライバ－':'ドライバ－', #1loo7-1lai2-1ba3，螺絲起子
		'ロ－ス':'ロ－ス', #1loo2-1suh4，里脊肉
		'マラソン':'マラソン', #1ma7-1la1-1song2，馬拉松
		'マッサ－ジ':'マッサ－ジ', #1ma7-1sa2-1tsi3，色情按摩、馬殺雞、按摩
		'マイク':'マイク', #1mai2-1ku3，麥克風
		'メロン':'メロン', #1me7-1long2，香瓜
		'めいし':'めいし', #1me2-1si3，名片
		'ミシン':'ミシン', #1mi7-1sin2，縫紉機、裁縫車
		'モ－タ－':'モ－タ－', #1moo2-1ta3，馬達
		'ナイロン':'ナイロン', #1nai5-1long2，耐龍、尼龍
		'ネクタイ':'ネクタイ', #1ne7-1kut8-1tai2，領帶
		'ねえちゃん':'ねえちゃん', #1ne2-1tsiang3，飯店或旅館的女服務員、女中
		'のうしんとう':'のうしんとう', #1noo5-1sin2，腦筋不正常
		'おばさん':'おばさん', #1oo7-1ba1-1sang2，歐巴桑、對不特定年長女性的稱呼
		'おじさん':'おじさん', #1oo7-1ji1-1sang2，歐吉桑、對不特定年長男性的稱呼
		'おでん':'おでん', #1oo7-1lian2，黑輪
		'おにんぎょう':'おにんぎょう', #1oo7-1lin1-1gioo2，洋娃娃、人偶
		'おねえさん':'おねえさん', #1oo7-1ne2-1sang3，大姐
		'オ－トバイ':'オ－トバイ', #1oo7-1too1-1bai2，機車、摩托車
		'オ－バ－コ－ト/オ－バ－':'オ－バ－コ－ト/オ－バ－', #1oo2-1ba3，長外套、長大衣
		'パチンコ':'パチンコ', #1pha7-1tsin2-1koo3，柏青哥
		'パ－セント':'パ－セント', #1pha5-1sian2-1too3，百分率、百分比
		'パン':'パン', #1phang2，麵包
		'パンク':'パンク', #1phang2-1ku3，爆胎
		'ペンチ':'ペンチ', #1phian2-1tsih4，鐵鉗
		'ピンポン':'ピンポン', #1phin5-1phong2，桌球、乒乓球
		'ポンプ':'ポンプ', #1phong2-1phu3，幫浦、手動抽水機
		'ブル－ス':'ブル－ス', #1pu7-1lu2-1su3，布魯司
		'サ－ビス':'サ－ビス', #1sa5-1bi2-1su3，額外優待、優惠
		'サイズ':'サイズ', #1sai2-1su3，尺寸
		'サック':'サック', #1sak5-1khuh4，保險套
		'サンプル':'サンプル', #1sam5-1phu1-1luh4，樣品、樣本
		'さんま':'さんま', #1san2-1bah4，秋刀魚
		'セ－フ':'セ－フ', #1se2-1hu3，安全
		'しゃしん':'しゃしん', #1sia7-1sin2，照片
		'セット':'セット', #1siat8-1tooh4，造型、做頭髮
		'シャツ':'シャツ', #1siat8-1tsuh4，襯衫
		'しょくパン':'しょくパン', #1siok3-1phang2，吐司、白麵包
		'すベりだい':'すベりだい', #1sir7-1be1-1li1-1lai2，溜滑梯
		'ステンレス':'ステンレス', #1sir7-1ten1-1le2-1su3，不鏽鋼
		'ソ－ス':'ソ－ス', #1soo2-1su3，醬料、烏醋
		'スク－タ－':'スク－タ－', #1su7-1khu2-1ta3，速可達、50cc輕型機車
		'スリッパ':'スリッパ', #1su7-1lit8-1pah4，拖鞋
		'ストリップ':'ストリップ', #1su7-1to1-1lip5-1puh4，脫衣舞
		'たくあん':'たくあん', #1tha7-1khu1-1ang2，黃蘿蔔、黃色的醃漬蘿蔔
		'タクシ－':'タクシ－', #1tha7-1khu1-1sih4，計程車
		'タイヤ':'タイヤ', #1thai2-1ia3，輪胎
		'タイル':'タイル', #1thai2-1lu3，瓷磚
		'タンゴ':'タンゴ', #1than2-1goo3，探戈
		'たんす':'たんす', #1thang2-1su3，衣櫥
		'テンプラ':'テンプラ', #1thian5-1pu1-1lah4，甜不辣
		'トラック':'トラック', #1thoo7-1la1-1khuh4，卡車
		'とうさん':'とうさん', #1too2-1sang3，多桑、父親
		'ちゃんばら':'ちゃんばら', #1tshian5-1pa1-1lah4，兒童模擬武打戲的、日本古裝武打戲
		'チョッキ':'チョッキ', #1tsiok5-1kih4，剪刀
		'チョコレ－ト':'チョコレ－ト', #1tsioo7-1koo1-1le2-1too3，巧克力
		'チップ':'チップ', #1tsit8-1puh4，小費
		'うどん':'うどん', #1u7-1long2，烏龍麵
		'ワイシャツ':'ワイシャツ', #1uai5-1siat8-1tsuh4，白襯衫
		'うんちゃん':'うんちゃん', #1un2-1tsiang3，運將、司機
		}
if __name__ == '__main__':
	教育部外來詞匯入資料庫()
